cf_billing/InformationRegisters/энргФормыУправленияМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргФормыУправленияМКД</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФормаУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргФормыУправленияМКД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетОбъемовВыполняетУК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргФормыУправленияМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргФормыУправленияМКД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТСЖ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаУправленияНеВыбрана</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/InformationRegisters/энргФормыУправленияМКД/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает признак распределения.
//
// Параметры:
//  Период			-	Дата.
//  ДанныеСтроения	-	Структура.
//  ФормаУправления	-	ПеречислениеСсылка.энргФормыУправленияМКД.
// 
// Возвращаемое значение:
//   Булево.
//
Функция ПолучитьПризнакРаспределения(Период, ДанныеСтроения, ФормаУправления = Неопределено) Экспорт 
	ТекФормаУправления = ФормаУправления;
	Если ФормаУправления = Неопределено Тогда
		Ответ = ПолучитьФормуУправленияПоМКД(Период, ДанныеСтроения.Организация, ДанныеСтроения.Район, ДанныеСтроения.МКД);
		Если Ответ.Количество() > 0 Тогда
			ТекФормаУправления = Ответ[0].ФормаУправления;
		КонецЕсли;
		
	КонецЕсли;
	
	Распределять = ТекФормаУправления = Перечисления.энргФормыУправленияМКД.УК 
					или ТекФормаУправления = Перечисления.энргФормыУправленияМКД.ТСЖ;
	
	Возврат НЕ Распределять;
КонецФункции

// Проверяет УК.
//
// Параметры:
//  ФормаУправления	-	ПеречислениеСсылка.энргФормыУправленияМКД.
// 
// Возвращаемое значение:
//   Булево.
//
Функция ПроверятьУК(ФормаУправления) Экспорт
	Проверять = ФормаУправления = Перечисления.энргФормыУправленияМКД.УК 
					или ФормаУправления = Перечисления.энргФормыУправленияМКД.ТСЖ;
					
	Возврат Проверять;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает форму управления по МКД.
//
// Параметры:
//  Период		-	Дата.
//  Организация	-	СправочникСсылка.Организации.
//  Район		-	СправочникСсылка.энргЗоныОтвественности.
//  МКД			-	СправочникСсылка.энргСтроения.
// 
// Возвращаемое значение:
//   ПеречислениеСсылка.энргФормыУправленияМКД.
//
Функция ПолучитьФормуУправленияПоМКД(Период, Организация, Район, МКД) Экспорт
	Возврат РегистрыСведений.энргФормыУправленияМКД.СрезПоследних(Период, Новый Структура("Организация, Район, МКД", Организация, Район, МКД));
КонецФункции

#КонецОбласти

#КонецЕсли
